UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h72_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32H72_gpio_v1_0_Modes.xml*/

#if !defined(_STM32H72_PINMUX_H_)
# define _STM32H72_PINMUX_H_

#define CEC_FUNC                 0
#define COMP1_OUT_FUNC           1
#define COMP2_OUT_FUNC           2
#define DCMI_D0_FUNC             3
#define DCMI_D1_FUNC             4
#define DCMI_D10_FUNC            5
#define DCMI_D11_FUNC            6
#define DCMI_D12_FUNC            7
#define DCMI_D13_FUNC            8
#define DCMI_D2_FUNC             9
#define DCMI_D3_FUNC             10
#define DCMI_D4_FUNC             11
#define DCMI_D5_FUNC             12
#define DCMI_D6_FUNC             13
#define DCMI_D7_FUNC             14
#define DCMI_D8_FUNC             15
#define DCMI_D9_FUNC             16
#define DCMI_HSYNC_FUNC          17
#define DCMI_PIXCLK_FUNC         18
#define DCMI_VSYNC_FUNC          19
#define DEBUG_TRACECLK_FUNC      20
#define DEBUG_TRACED0_FUNC       21
#define DEBUG_TRACED1_FUNC       22
#define DEBUG_TRACED2_FUNC       23
#define DEBUG_TRACED3_FUNC       24
#define DEBUG_TRGIO_FUNC         25
#define DFSDM1_CKIN0_FUNC        26
#define DFSDM1_CKIN1_FUNC        27
#define DFSDM1_CKIN2_FUNC        28
#define DFSDM1_CKIN3_FUNC        29
#define DFSDM1_CKIN4_FUNC        30
#define DFSDM1_CKIN5_FUNC        31
#define DFSDM1_CKIN6_FUNC        32
#define DFSDM1_CKIN7_FUNC        33
#define DFSDM1_CKOUT_FUNC        34
#define DFSDM1_DATIN0_FUNC       35
#define DFSDM1_DATIN1_FUNC       36
#define DFSDM1_DATIN2_FUNC       37
#define DFSDM1_DATIN3_FUNC       38
#define DFSDM1_DATIN4_FUNC       39
#define DFSDM1_DATIN5_FUNC       40
#define DFSDM1_DATIN6_FUNC       41
#define DFSDM1_DATIN7_FUNC       42
#define ETH_COL_FUNC             43
#define ETH_CRS_FUNC             44
#define ETH_CRS_DV_FUNC          45
#define ETH_MDC_FUNC             46
#define ETH_MDIO_FUNC            47
#define ETH_PPS_OUT_FUNC         48
#define ETH_REF_CLK_FUNC         49
#define ETH_RXD0_FUNC            50
#define ETH_RXD1_FUNC            51
#define ETH_RXD2_FUNC            52
#define ETH_RXD3_FUNC            53
#define ETH_RX_CLK_FUNC          54
#define ETH_RX_DV_FUNC           55
#define ETH_RX_ER_FUNC           56
#define ETH_TXD0_FUNC            57
#define ETH_TXD1_FUNC            58
#define ETH_TXD3_FUNC            59
#define ETH_TX_EN_FUNC           60
#define ETH_TX_ER_FUNC           61
#define EVENTOUT_FUNC            62
#define FDCAN1_RX_FUNC           63
#define FDCAN1_TX_FUNC           64
#define FDCAN2_RX_FUNC           65
#define FDCAN2_TX_FUNC           66
#define FDCAN3_RX_FUNC           67
#define FDCAN3_TX_FUNC           68
#define FMC_A0_FUNC              69
#define FMC_A1_FUNC              70
#define FMC_A10_FUNC             71
#define FMC_A11_FUNC             72
#define FMC_A12_FUNC             73
#define FMC_A13_FUNC             74
#define FMC_A14_FUNC             75
#define FMC_A15_FUNC             76
#define FMC_A16_FUNC             77
#define FMC_A17_FUNC             78
#define FMC_A18_FUNC             79
#define FMC_A19_FUNC             80
#define FMC_A2_FUNC              81
#define FMC_A20_FUNC             82
#define FMC_A21_FUNC             83
#define FMC_A22_FUNC             84
#define FMC_A23_FUNC             85
#define FMC_A24_FUNC             86
#define FMC_A25_FUNC             87
#define FMC_A3_FUNC              88
#define FMC_A4_FUNC              89
#define FMC_A5_FUNC              90
#define FMC_A6_FUNC              91
#define FMC_A7_FUNC              92
#define FMC_A8_FUNC              93
#define FMC_A9_FUNC              94
#define FMC_ALE_FUNC             95
#define FMC_BA0_FUNC             96
#define FMC_BA1_FUNC             97
#define FMC_CLE_FUNC             98
#define FMC_CLK_FUNC             99
#define FMC_D0_FUNC              100
#define FMC_D1_FUNC              101
#define FMC_D10_FUNC             102
#define FMC_D11_FUNC             103
#define FMC_D12_FUNC             104
#define FMC_D13_FUNC             105
#define FMC_D14_FUNC             106
#define FMC_D15_FUNC             107
#define FMC_D16_FUNC             108
#define FMC_D17_FUNC             109
#define FMC_D18_FUNC             110
#define FMC_D19_FUNC             111
#define FMC_D2_FUNC              112
#define FMC_D20_FUNC             113
#define FMC_D21_FUNC             114
#define FMC_D22_FUNC             115
#define FMC_D23_FUNC             116
#define FMC_D3_FUNC              117
#define FMC_D4_FUNC              118
#define FMC_D5_FUNC              119
#define FMC_D6_FUNC              120
#define FMC_D7_FUNC              121
#define FMC_D8_FUNC              122
#define FMC_D9_FUNC              123
#define FMC_DA0_FUNC             124
#define FMC_DA1_FUNC             125
#define FMC_DA10_FUNC            126
#define FMC_DA11_FUNC            127
#define FMC_DA12_FUNC            128
#define FMC_DA13_FUNC            129
#define FMC_DA14_FUNC            130
#define FMC_DA15_FUNC            131
#define FMC_DA2_FUNC             132
#define FMC_DA3_FUNC             133
#define FMC_DA4_FUNC             134
#define FMC_DA5_FUNC             135
#define FMC_DA6_FUNC             136
#define FMC_DA7_FUNC             137
#define FMC_DA8_FUNC             138
#define FMC_DA9_FUNC             139
#define FMC_INT_FUNC             140
#define FMC_NBL0_FUNC            141
#define FMC_NBL1_FUNC            142
#define FMC_NCE_FUNC             143
#define FMC_NE1_FUNC             144
#define FMC_NE2_FUNC             145
#define FMC_NE3_FUNC             146
#define FMC_NE4_FUNC             147
#define FMC_NL_FUNC              148
#define FMC_NOE_FUNC             149
#define FMC_NWAIT_FUNC           150
#define FMC_NWE_FUNC             151
#define FMC_SDCKE0_FUNC          152
#define FMC_SDCKE1_FUNC          153
#define FMC_SDCLK_FUNC           154
#define FMC_SDNCAS_FUNC          155
#define FMC_SDNE0_FUNC           156
#define FMC_SDNE1_FUNC           157
#define FMC_SDNRAS_FUNC          158
#define FMC_SDNWE_FUNC           159
#define I2C1_SCL_FUNC            160
#define I2C1_SDA_FUNC            161
#define I2C1_SMBA_FUNC           162
#define I2C2_SCL_FUNC            163
#define I2C2_SDA_FUNC            164
#define I2C2_SMBA_FUNC           165
#define I2C3_SCL_FUNC            166
#define I2C3_SDA_FUNC            167
#define I2C3_SMBA_FUNC           168
#define I2C4_SCL_FUNC            169
#define I2C4_SDA_FUNC            170
#define I2C4_SMBA_FUNC           171
#define I2C5_SCL_FUNC            172
#define I2C5_SDA_FUNC            173
#define I2C5_SMBA_FUNC           174
#define I2S1_CK_FUNC             175
#define I2S1_MCK_FUNC            176
#define I2S1_SDI_FUNC            177
#define I2S1_SDO_FUNC            178
#define I2S1_WS_FUNC             179
#define I2S2_CK_FUNC             180
#define I2S2_MCK_FUNC            181
#define I2S2_SDI_FUNC            182
#define I2S2_SDO_FUNC            183
#define I2S2_WS_FUNC             184
#define I2S3_CK_FUNC             185
#define I2S3_MCK_FUNC            186
#define I2S3_SDI_FUNC            187
#define I2S3_SDO_FUNC            188
#define I2S3_WS_FUNC             189
#define I2S6_CK_FUNC             190
#define I2S6_MCK_FUNC            191
#define I2S6_SDI_FUNC            192
#define I2S6_SDO_FUNC            193
#define I2S6_WS_FUNC             194
#define I2S_CKIN_FUNC            195
#define LPTIM1_ETR_FUNC          196
#define LPTIM1_IN1_FUNC          197
#define LPTIM1_IN2_FUNC          198
#define LPTIM1_OUT_FUNC          199
#define LPTIM2_ETR_FUNC          200
#define LPTIM2_IN1_FUNC          201
#define LPTIM2_IN2_FUNC          202
#define LPTIM2_OUT_FUNC          203
#define LPTIM3_OUT_FUNC          204
#define LPTIM4_OUT_FUNC          205
#define LPTIM5_OUT_FUNC          206
#define LPUART1_CTS_FUNC         207
#define LPUART1_DE_FUNC          208
#define LPUART1_RTS_FUNC         209
#define LPUART1_RX_FUNC          210
#define LPUART1_TX_FUNC          211
#define LTDC_B0_FUNC             212
#define LTDC_B1_FUNC             213
#define LTDC_B2_FUNC             214
#define LTDC_B3_FUNC             215
#define LTDC_B4_FUNC             216
#define LTDC_B5_FUNC             217
#define LTDC_B6_FUNC             218
#define LTDC_B7_FUNC             219
#define LTDC_CLK_FUNC            220
#define LTDC_DE_FUNC             221
#define LTDC_G0_FUNC             222
#define LTDC_G1_FUNC             223
#define LTDC_G2_FUNC             224
#define LTDC_G3_FUNC             225
#define LTDC_G4_FUNC             226
#define LTDC_G5_FUNC             227
#define LTDC_G6_FUNC             228
#define LTDC_G7_FUNC             229
#define LTDC_HSYNC_FUNC          230
#define LTDC_R0_FUNC             231
#define LTDC_R1_FUNC             232
#define LTDC_R2_FUNC             233
#define LTDC_R3_FUNC             234
#define LTDC_R4_FUNC             235
#define LTDC_R5_FUNC             236
#define LTDC_R6_FUNC             237
#define LTDC_R7_FUNC             238
#define LTDC_VSYNC_FUNC          239
#define MDIOS_MDC_FUNC           240
#define MDIOS_MDIO_FUNC          241
#define OCTOSPIM_P1_CLK_FUNC     242
#define OCTOSPIM_P1_DQS_FUNC     243
#define OCTOSPIM_P1_IO0_FUNC     244
#define OCTOSPIM_P1_IO1_FUNC     245
#define OCTOSPIM_P1_IO2_FUNC     246
#define OCTOSPIM_P1_IO3_FUNC     247
#define OCTOSPIM_P1_IO4_FUNC     248
#define OCTOSPIM_P1_IO5_FUNC     249
#define OCTOSPIM_P1_IO6_FUNC     250
#define OCTOSPIM_P1_IO7_FUNC     251
#define OCTOSPIM_P1_NCLK_FUNC    252
#define OCTOSPIM_P1_NCS_FUNC     253
#define OCTOSPIM_P2_CLK_FUNC     254
#define OCTOSPIM_P2_DQS_FUNC     255
#define OCTOSPIM_P2_IO0_FUNC     256
#define OCTOSPIM_P2_IO1_FUNC     257
#define OCTOSPIM_P2_IO2_FUNC     258
#define OCTOSPIM_P2_IO3_FUNC     259
#define OCTOSPIM_P2_IO4_FUNC     260
#define OCTOSPIM_P2_IO5_FUNC     261
#define OCTOSPIM_P2_IO6_FUNC     262
#define OCTOSPIM_P2_IO7_FUNC     263
#define OCTOSPIM_P2_NCLK_FUNC    264
#define OCTOSPIM_P2_NCS_FUNC     265
#define PSSI_D0_FUNC             266
#define PSSI_D1_FUNC             267
#define PSSI_D10_FUNC            268
#define PSSI_D11_FUNC            269
#define PSSI_D12_FUNC            270
#define PSSI_D13_FUNC            271
#define PSSI_D14_FUNC            272
#define PSSI_D15_FUNC            273
#define PSSI_D2_FUNC             274
#define PSSI_D3_FUNC             275
#define PSSI_D4_FUNC             276
#define PSSI_D5_FUNC             277
#define PSSI_D6_FUNC             278
#define PSSI_D7_FUNC             279
#define PSSI_D8_FUNC             280
#define PSSI_D9_FUNC             281
#define PSSI_DE_FUNC             282
#define PSSI_PDCK_FUNC           283
#define PSSI_RDY_FUNC            284
#define RCC_MCO_1_FUNC           285
#define RCC_MCO_2_FUNC           286
#define RTC_OUT_ALARM_FUNC       287
#define RTC_OUT_CALIB_FUNC       288
#define RTC_REFIN_FUNC           289
#define SAI1_CK1_FUNC            290
#define SAI1_CK2_FUNC            291
#define SAI1_D1_FUNC             292
#define SAI1_D2_FUNC             293
#define SAI1_D3_FUNC             294
#define SAI1_FS_A_FUNC           295
#define SAI1_FS_B_FUNC           296
#define SAI1_MCLK_A_FUNC         297
#define SAI1_MCLK_B_FUNC         298
#define SAI1_SCK_A_FUNC          299
#define SAI1_SCK_B_FUNC          300
#define SAI1_SD_A_FUNC           301
#define SAI1_SD_B_FUNC           302
#define SAI4_CK1_FUNC            303
#define SAI4_CK2_FUNC            304
#define SAI4_D1_FUNC             305
#define SAI4_D2_FUNC             306
#define SAI4_D3_FUNC             307
#define SAI4_FS_A_FUNC           308
#define SAI4_FS_B_FUNC           309
#define SAI4_MCLK_A_FUNC         310
#define SAI4_MCLK_B_FUNC         311
#define SAI4_SCK_A_FUNC          312
#define SAI4_SCK_B_FUNC          313
#define SAI4_SD_A_FUNC           314
#define SAI4_SD_B_FUNC           315
#define SDMMC1_CDIR_FUNC         316
#define SDMMC1_CK_FUNC           317
#define SDMMC1_CKIN_FUNC         318
#define SDMMC1_CMD_FUNC          319
#define SDMMC1_D0_FUNC           320
#define SDMMC1_D0DIR_FUNC        321
#define SDMMC1_D1_FUNC           322
#define SDMMC1_D123DIR_FUNC      323
#define SDMMC1_D2_FUNC           324
#define SDMMC1_D3_FUNC           325
#define SDMMC1_D4_FUNC           326
#define SDMMC1_D5_FUNC           327
#define SDMMC1_D6_FUNC           328
#define SDMMC1_D7_FUNC           329
#define SDMMC2_CK_FUNC           330
#define SDMMC2_CKIN_FUNC         331
#define SDMMC2_CMD_FUNC          332
#define SDMMC2_D0_FUNC           333
#define SDMMC2_D1_FUNC           334
#define SDMMC2_D2_FUNC           335
#define SDMMC2_D3_FUNC           336
#define SDMMC2_D4_FUNC           337
#define SDMMC2_D5_FUNC           338
#define SDMMC2_D6_FUNC           339
#define SDMMC2_D7_FUNC           340
#define SPDIFRX1_IN1_FUNC        341
#define SPDIFRX1_IN2_FUNC        342
#define SPDIFRX1_IN3_FUNC        343
#define SPDIFRX1_IN4_FUNC        344
#define SPI1_MISO_FUNC           345
#define SPI1_MOSI_FUNC           346
#define SPI1_NSS_FUNC            347
#define SPI1_SCK_FUNC            348
#define SPI2_MISO_FUNC           349
#define SPI2_MOSI_FUNC           350
#define SPI2_NSS_FUNC            351
#define SPI2_SCK_FUNC            352
#define SPI3_MISO_FUNC           353
#define SPI3_MOSI_FUNC           354
#define SPI3_NSS_FUNC            355
#define SPI3_SCK_FUNC            356
#define SPI4_MISO_FUNC           357
#define SPI4_MOSI_FUNC           358
#define SPI4_NSS_FUNC            359
#define SPI4_SCK_FUNC            360
#define SPI5_MISO_FUNC           361
#define SPI5_MOSI_FUNC           362
#define SPI5_NSS_FUNC            363
#define SPI5_SCK_FUNC            364
#define SPI6_MISO_FUNC           365
#define SPI6_MOSI_FUNC           366
#define SPI6_NSS_FUNC            367
#define SPI6_SCK_FUNC            368
#define SWPMI1_RX_FUNC           369
#define SWPMI1_SUSPEND_FUNC      370
#define SWPMI1_TX_FUNC           371
#define TIM12_CH1_FUNC           372
#define TIM12_CH2_FUNC           373
#define TIM13_CH1_FUNC           374
#define TIM14_CH1_FUNC           375
#define TIM15_BKIN_FUNC          376
#define TIM15_CH1_FUNC           377
#define TIM15_CH1N_FUNC          378
#define TIM15_CH2_FUNC           379
#define TIM16_BKIN_FUNC          380
#define TIM16_CH1_FUNC           381
#define TIM16_CH1N_FUNC          382
#define TIM17_BKIN_FUNC          383
#define TIM17_CH1_FUNC           384
#define TIM17_CH1N_FUNC          385
#define TIM1_BKIN_FUNC           386
#define TIM1_BKIN2_FUNC          387
#define TIM1_BKIN2_COMP1_FUNC    388
#define TIM1_BKIN2_COMP2_FUNC    389
#define TIM1_BKIN_COMP1_FUNC     390
#define TIM1_BKIN_COMP2_FUNC     391
#define TIM1_CH1_FUNC            392
#define TIM1_CH1N_FUNC           393
#define TIM1_CH2_FUNC            394
#define TIM1_CH2N_FUNC           395
#define TIM1_CH3_FUNC            396
#define TIM1_CH3N_FUNC           397
#define TIM1_CH4_FUNC            398
#define TIM1_ETR_FUNC            399
#define TIM23_CH1_FUNC           400
#define TIM23_CH2_FUNC           401
#define TIM23_CH3_FUNC           402
#define TIM23_CH4_FUNC           403
#define TIM23_ETR_FUNC           404
#define TIM24_CH1_FUNC           405
#define TIM24_CH2_FUNC           406
#define TIM24_CH3_FUNC           407
#define TIM24_CH4_FUNC           408
#define TIM24_ETR_FUNC           409
#define TIM2_CH1_FUNC            410
#define TIM2_CH2_FUNC            411
#define TIM2_CH3_FUNC            412
#define TIM2_CH4_FUNC            413
#define TIM2_ETR_FUNC            414
#define TIM3_CH1_FUNC            415
#define TIM3_CH2_FUNC            416
#define TIM3_CH3_FUNC            417
#define TIM3_CH4_FUNC            418
#define TIM3_ETR_FUNC            419
#define TIM4_CH1_FUNC            420
#define TIM4_CH2_FUNC            421
#define TIM4_CH3_FUNC            422
#define TIM4_CH4_FUNC            423
#define TIM4_ETR_FUNC            424
#define TIM5_CH1_FUNC            425
#define TIM5_CH2_FUNC            426
#define TIM5_CH3_FUNC            427
#define TIM5_CH4_FUNC            428
#define TIM5_ETR_FUNC            429
#define TIM8_BKIN_FUNC           430
#define TIM8_BKIN2_FUNC          431
#define TIM8_BKIN2_COMP1_FUNC    432
#define TIM8_BKIN2_COMP2_FUNC    433
#define TIM8_BKIN_COMP1_FUNC     434
#define TIM8_BKIN_COMP2_FUNC     435
#define TIM8_CH1_FUNC            436
#define TIM8_CH1N_FUNC           437
#define TIM8_CH2_FUNC            438
#define TIM8_CH2N_FUNC           439
#define TIM8_CH3_FUNC            440
#define TIM8_CH3N_FUNC           441
#define TIM8_CH4_FUNC            442
#define TIM8_ETR_FUNC            443
#define UART4_CTS_FUNC           444
#define UART4_DE_FUNC            445
#define UART4_RTS_FUNC           446
#define UART4_RX_FUNC            447
#define UART4_TX_FUNC            448
#define UART5_CTS_FUNC           449
#define UART5_DE_FUNC            450
#define UART5_RTS_FUNC           451
#define UART5_RX_FUNC            452
#define UART5_TX_FUNC            453
#define UART7_CTS_FUNC           454
#define UART7_DE_FUNC            455
#define UART7_RTS_FUNC           456
#define UART7_RX_FUNC            457
#define UART7_TX_FUNC            458
#define UART8_CTS_FUNC           459
#define UART8_DE_FUNC            460
#define UART8_RTS_FUNC           461
#define UART8_RX_FUNC            462
#define UART8_TX_FUNC            463
#define UART9_CTS_FUNC           464
#define UART9_DE_FUNC            465
#define UART9_RTS_FUNC           466
#define UART9_RX_FUNC            467
#define UART9_TX_FUNC            468
#define USART10_CK_FUNC          469
#define UART10_CK_FUNC           469
#define USART10_CTS_FUNC         470
#define UART10_CTS_FUNC          470
#define USART10_DE_FUNC          471
#define UART10_DE_FUNC           471
#define USART10_NSS_FUNC         472
#define UART10_NSS_FUNC          472
#define USART10_RTS_FUNC         473
#define UART10_RTS_FUNC          473
#define USART10_RX_FUNC          474
#define UART10_RX_FUNC           474
#define USART10_TX_FUNC          475
#define UART10_TX_FUNC           475
#define USART1_CK_FUNC           476
#define UART1_CK_FUNC            476
#define USART1_CTS_FUNC          477
#define UART1_CTS_FUNC           477
#define USART1_DE_FUNC           478
#define UART1_DE_FUNC            478
#define USART1_NSS_FUNC          479
#define UART1_NSS_FUNC           479
#define USART1_RTS_FUNC          480
#define UART1_RTS_FUNC           480
#define USART1_RX_FUNC           481
#define UART1_RX_FUNC            481
#define USART1_TX_FUNC           482
#define UART1_TX_FUNC            482
#define USART2_CK_FUNC           483
#define UART2_CK_FUNC            483
#define USART2_CTS_FUNC          484
#define UART2_CTS_FUNC           484
#define USART2_DE_FUNC           485
#define UART2_DE_FUNC            485
#define USART2_NSS_FUNC          486
#define UART2_NSS_FUNC           486
#define USART2_RTS_FUNC          487
#define UART2_RTS_FUNC           487
#define USART2_RX_FUNC           488
#define UART2_RX_FUNC            488
#define USART2_TX_FUNC           489
#define UART2_TX_FUNC            489
#define USART3_CK_FUNC           490
#define UART3_CK_FUNC            490
#define USART3_CTS_FUNC          491
#define UART3_CTS_FUNC           491
#define USART3_DE_FUNC           492
#define UART3_DE_FUNC            492
#define USART3_NSS_FUNC          493
#define UART3_NSS_FUNC           493
#define USART3_RTS_FUNC          494
#define UART3_RTS_FUNC           494
#define USART3_RX_FUNC           495
#define UART3_RX_FUNC            495
#define USART3_TX_FUNC           496
#define UART3_TX_FUNC            496
#define USART6_CK_FUNC           497
#define UART6_CK_FUNC            497
#define USART6_CTS_FUNC          498
#define UART6_CTS_FUNC           498
#define USART6_DE_FUNC           499
#define UART6_DE_FUNC            499
#define USART6_NSS_FUNC          500
#define UART6_NSS_FUNC           500
#define USART6_RTS_FUNC          501
#define UART6_RTS_FUNC           501
#define USART6_RX_FUNC           502
#define UART6_RX_FUNC            502
#define USART6_TX_FUNC           503
#define UART6_TX_FUNC            503
#define USB_OTG_HS_ID_FUNC       504
#define USB_OTG_HS_SOF_FUNC      505
#define USB_OTG_HS_ULPI_CK_FUNC  506
#define USB_OTG_HS_ULPI_D0_FUNC  507
#define USB_OTG_HS_ULPI_D1_FUNC  508
#define USB_OTG_HS_ULPI_D2_FUNC  509
#define USB_OTG_HS_ULPI_D3_FUNC  510
#define USB_OTG_HS_ULPI_D4_FUNC  511
#define USB_OTG_HS_ULPI_D5_FUNC  512
#define USB_OTG_HS_ULPI_D6_FUNC  513
#define USB_OTG_HS_ULPI_D7_FUNC  514
#define USB_OTG_HS_ULPI_NXT_FUNC 515
#define USB_OTG_HS_ULPI_STP_FUNC 516

