UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h72_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PA00) && (func == TIM15_BKIN_FUNC          )) ?  4 : \
	((gpio == PA00) && (func == I2S6_WS_FUNC             )) ?  5 : \
	((gpio == PA00) && (func == SPI6_NSS_FUNC            )) ?  5 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == USART2_NSS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PA00) && (func == SDMMC2_CMD_FUNC          )) ?  9 : \
	((gpio == PA00) && (func == SAI4_SD_B_FUNC           )) ? 10 : \
	((gpio == PA00) && (func == ETH_CRS_FUNC             )) ? 11 : \
	((gpio == PA00) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PA00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == LPTIM3_OUT_FUNC          )) ?  3 : \
	((gpio == PA01) && (func == TIM15_CH1N_FUNC          )) ?  4 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PA01) && (func == OCTOSPIM_P1_IO3_FUNC     )) ?  9 : \
	((gpio == PA01) && (func == SAI4_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PA01) && (func == ETH_REF_CLK_FUNC         )) ? 11 : \
	((gpio == PA01) && (func == ETH_RX_CLK_FUNC          )) ? 11 : \
	((gpio == PA01) && (func == OCTOSPIM_P1_DQS_FUNC     )) ? 12 : \
	((gpio == PA01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == LPTIM4_OUT_FUNC          )) ?  3 : \
	((gpio == PA02) && (func == TIM15_CH1_FUNC           )) ?  4 : \
	((gpio == PA02) && (func == OCTOSPIM_P1_IO0_FUNC     )) ?  6 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == SAI4_SCK_B_FUNC          )) ?  8 : \
	((gpio == PA02) && (func == ETH_MDIO_FUNC            )) ? 11 : \
	((gpio == PA02) && (func == MDIOS_MDIO_FUNC          )) ? 12 : \
	((gpio == PA02) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PA02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == LPTIM5_OUT_FUNC          )) ?  3 : \
	((gpio == PA03) && (func == TIM15_CH2_FUNC           )) ?  4 : \
	((gpio == PA03) && (func == I2S6_MCK_FUNC            )) ?  5 : \
	((gpio == PA03) && (func == OCTOSPIM_P1_IO2_FUNC     )) ?  6 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == LTDC_B2_FUNC             )) ?  9 : \
	((gpio == PA03) && (func == USB_OTG_HS_ULPI_D0_FUNC  )) ? 10 : \
	((gpio == PA03) && (func == ETH_COL_FUNC             )) ? 11 : \
	((gpio == PA03) && (func == OCTOSPIM_P1_CLK_FUNC     )) ? 12 : \
	((gpio == PA03) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PA03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA04) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PA04) && (func == I2S1_WS_FUNC             )) ?  5 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == I2S6_WS_FUNC             )) ?  8 : \
	((gpio == PA04) && (func == SPI6_NSS_FUNC            )) ?  8 : \
	((gpio == PA04) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PA04) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PA04) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PA04) && (func == PSSI_DE_FUNC             )) ? 13 : \
	((gpio == PA04) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PA04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA05) && (func == I2S1_CK_FUNC             )) ?  5 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == I2S6_CK_FUNC             )) ?  8 : \
	((gpio == PA05) && (func == SPI6_SCK_FUNC            )) ?  8 : \
	((gpio == PA05) && (func == USB_OTG_HS_ULPI_CK_FUNC  )) ? 10 : \
	((gpio == PA05) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PA05) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PA05) && (func == PSSI_D14_FUNC            )) ? 13 : \
	((gpio == PA05) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PA05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PA06) && (func == I2S1_SDI_FUNC            )) ?  5 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == OCTOSPIM_P1_IO3_FUNC     )) ?  6 : \
	((gpio == PA06) && (func == I2S6_SDI_FUNC            )) ?  8 : \
	((gpio == PA06) && (func == SPI6_MISO_FUNC           )) ?  8 : \
	((gpio == PA06) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PA06) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 10 : \
	((gpio == PA06) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 10 : \
	((gpio == PA06) && (func == MDIOS_MDC_FUNC           )) ? 11 : \
	((gpio == PA06) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 12 : \
	((gpio == PA06) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 12 : \
	((gpio == PA06) && (func == DCMI_PIXCLK_FUNC         )) ? 13 : \
	((gpio == PA06) && (func == PSSI_PDCK_FUNC           )) ? 13 : \
	((gpio == PA06) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA07) && (func == I2S1_SDO_FUNC            )) ?  5 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == I2S6_SDO_FUNC            )) ?  8 : \
	((gpio == PA07) && (func == SPI6_MOSI_FUNC           )) ?  8 : \
	((gpio == PA07) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PA07) && (func == OCTOSPIM_P1_IO2_FUNC     )) ? 10 : \
	((gpio == PA07) && (func == ETH_CRS_DV_FUNC          )) ? 11 : \
	((gpio == PA07) && (func == ETH_RX_DV_FUNC           )) ? 11 : \
	((gpio == PA07) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PA07) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA08) && (func == RCC_MCO_1_FUNC           )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA08) && (func == I2C5_SCL_FUNC            )) ?  6 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == USB_OTG_HS_SOF_FUNC      )) ? 10 : \
	((gpio == PA08) && (func == UART7_RX_FUNC            )) ? 11 : \
	((gpio == PA08) && (func == TIM8_BKIN2_COMP1_FUNC    )) ? 12 : \
	((gpio == PA08) && (func == TIM8_BKIN2_COMP2_FUNC    )) ? 12 : \
	((gpio == PA08) && (func == LTDC_B3_FUNC             )) ? 13 : \
	((gpio == PA08) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == LPUART1_TX_FUNC          )) ?  3 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PA09) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PA09) && (func == I2C5_SMBA_FUNC           )) ?  6 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == ETH_TX_ER_FUNC           )) ? 11 : \
	((gpio == PA09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PA09) && (func == PSSI_D0_FUNC             )) ? 13 : \
	((gpio == PA09) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PA09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == LPUART1_RX_FUNC          )) ?  3 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == USB_OTG_HS_ID_FUNC       )) ? 10 : \
	((gpio == PA10) && (func == MDIOS_MDIO_FUNC          )) ? 11 : \
	((gpio == PA10) && (func == LTDC_B4_FUNC             )) ? 12 : \
	((gpio == PA10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PA10) && (func == PSSI_D1_FUNC             )) ? 13 : \
	((gpio == PA10) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PA10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == LPUART1_CTS_FUNC         )) ?  3 : \
	((gpio == PA11) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PA11) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PA11) && (func == UART4_RX_FUNC            )) ?  6 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == USART1_NSS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PA11) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == LPUART1_DE_FUNC          )) ?  3 : \
	((gpio == PA12) && (func == LPUART1_RTS_FUNC         )) ?  3 : \
	((gpio == PA12) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PA12) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PA12) && (func == UART4_TX_FUNC            )) ?  6 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == SAI4_FS_B_FUNC           )) ?  8 : \
	((gpio == PA12) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PA12) && (func == TIM1_BKIN2_FUNC          )) ? 12 : \
	((gpio == PA12) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB00) && (func == OCTOSPIM_P1_IO1_FUNC     )) ?  4 : \
	((gpio == PB00) && (func == DFSDM1_CKOUT_FUNC        )) ?  6 : \
	((gpio == PB00) && (func == UART4_CTS_FUNC           )) ?  8 : \
	((gpio == PB00) && (func == LTDC_R3_FUNC             )) ?  9 : \
	((gpio == PB00) && (func == USB_OTG_HS_ULPI_D1_FUNC  )) ? 10 : \
	((gpio == PB00) && (func == ETH_RXD2_FUNC            )) ? 11 : \
	((gpio == PB00) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB01) && (func == OCTOSPIM_P1_IO0_FUNC     )) ?  4 : \
	((gpio == PB01) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PB01) && (func == LTDC_R6_FUNC             )) ?  9 : \
	((gpio == PB01) && (func == USB_OTG_HS_ULPI_D2_FUNC  )) ? 10 : \
	((gpio == PB01) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PB01) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PB01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB02) && (func == RTC_OUT_ALARM_FUNC       )) ?  0 : \
	((gpio == PB02) && (func == RTC_OUT_CALIB_FUNC       )) ?  0 : \
	((gpio == PB02) && (func == SAI4_D1_FUNC             )) ?  1 : \
	((gpio == PB02) && (func == SAI1_D1_FUNC             )) ?  2 : \
	((gpio == PB02) && (func == DFSDM1_CKIN1_FUNC        )) ?  4 : \
	((gpio == PB02) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PB02) && (func == I2S3_SDO_FUNC            )) ?  7 : \
	((gpio == PB02) && (func == SPI3_MOSI_FUNC           )) ?  7 : \
	((gpio == PB02) && (func == SAI4_SD_A_FUNC           )) ?  8 : \
	((gpio == PB02) && (func == OCTOSPIM_P1_CLK_FUNC     )) ?  9 : \
	((gpio == PB02) && (func == OCTOSPIM_P1_DQS_FUNC     )) ? 10 : \
	((gpio == PB02) && (func == ETH_TX_ER_FUNC           )) ? 11 : \
	((gpio == PB02) && (func == TIM23_ETR_FUNC           )) ? 13 : \
	((gpio == PB02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB05) && (func == TIM17_BKIN_FUNC          )) ?  1 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == LTDC_B5_FUNC             )) ?  3 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == I2S1_SDO_FUNC            )) ?  5 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2C4_SMBA_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == I2S3_SDO_FUNC            )) ?  7 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  7 : \
	((gpio == PB05) && (func == I2S6_SDO_FUNC            )) ?  8 : \
	((gpio == PB05) && (func == SPI6_MOSI_FUNC           )) ?  8 : \
	((gpio == PB05) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB05) && (func == USB_OTG_HS_ULPI_D7_FUNC  )) ? 10 : \
	((gpio == PB05) && (func == ETH_PPS_OUT_FUNC         )) ? 11 : \
	((gpio == PB05) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PB05) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PB05) && (func == PSSI_D10_FUNC            )) ? 13 : \
	((gpio == PB05) && (func == UART5_RX_FUNC            )) ? 14 : \
	((gpio == PB05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ?  1 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == CEC_FUNC                 )) ?  5 : \
	((gpio == PB06) && (func == I2C4_SCL_FUNC            )) ?  6 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PB06) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB06) && (func == OCTOSPIM_P1_NCS_FUNC     )) ? 10 : \
	((gpio == PB06) && (func == DFSDM1_DATIN5_FUNC       )) ? 11 : \
	((gpio == PB06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PB06) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PB06) && (func == PSSI_D5_FUNC             )) ? 13 : \
	((gpio == PB06) && (func == UART5_TX_FUNC            )) ? 14 : \
	((gpio == PB06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB07) && (func == TIM17_CH1N_FUNC          )) ?  1 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PB07) && (func == DFSDM1_CKIN5_FUNC        )) ? 11 : \
	((gpio == PB07) && (func == FMC_NL_FUNC              )) ? 12 : \
	((gpio == PB07) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PB07) && (func == PSSI_RDY_FUNC            )) ? 13 : \
	((gpio == PB07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ?  1 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == DFSDM1_CKIN7_FUNC        )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == I2C4_SCL_FUNC            )) ?  6 : \
	((gpio == PB08) && (func == SDMMC1_CKIN_FUNC         )) ?  7 : \
	((gpio == PB08) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PB08) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PB08) && (func == SDMMC2_D4_FUNC           )) ? 10 : \
	((gpio == PB08) && (func == ETH_TXD3_FUNC            )) ? 11 : \
	((gpio == PB08) && (func == SDMMC1_D4_FUNC           )) ? 12 : \
	((gpio == PB08) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PB08) && (func == PSSI_D6_FUNC             )) ? 13 : \
	((gpio == PB08) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PB08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB09) && (func == TIM17_CH1_FUNC           )) ?  1 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == DFSDM1_DATIN7_FUNC       )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == I2C4_SDA_FUNC            )) ?  6 : \
	((gpio == PB09) && (func == SDMMC1_CDIR_FUNC         )) ?  7 : \
	((gpio == PB09) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PB09) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PB09) && (func == SDMMC2_D5_FUNC           )) ? 10 : \
	((gpio == PB09) && (func == I2C4_SMBA_FUNC           )) ? 11 : \
	((gpio == PB09) && (func == SDMMC1_D5_FUNC           )) ? 12 : \
	((gpio == PB09) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PB09) && (func == PSSI_D7_FUNC             )) ? 13 : \
	((gpio == PB09) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == LPTIM2_IN1_FUNC          )) ?  3 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == DFSDM1_DATIN7_FUNC       )) ?  6 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == OCTOSPIM_P1_NCS_FUNC     )) ?  9 : \
	((gpio == PB10) && (func == USB_OTG_HS_ULPI_D3_FUNC  )) ? 10 : \
	((gpio == PB10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PB10) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PB10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == LPTIM2_ETR_FUNC          )) ?  3 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == DFSDM1_CKIN7_FUNC        )) ?  6 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == USB_OTG_HS_ULPI_D4_FUNC  )) ? 10 : \
	((gpio == PB11) && (func == ETH_TX_EN_FUNC           )) ? 11 : \
	((gpio == PB11) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == OCTOSPIM_P1_NCLK_FUNC    )) ?  3 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == DFSDM1_DATIN1_FUNC       )) ?  6 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == FDCAN2_RX_FUNC           )) ?  9 : \
	((gpio == PB12) && (func == USB_OTG_HS_ULPI_D5_FUNC  )) ? 10 : \
	((gpio == PB12) && (func == ETH_TXD0_FUNC            )) ? 11 : \
	((gpio == PB12) && (func == OCTOSPIM_P1_IO0_FUNC     )) ? 12 : \
	((gpio == PB12) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 13 : \
	((gpio == PB12) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 13 : \
	((gpio == PB12) && (func == UART5_RX_FUNC            )) ? 14 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == LPTIM2_OUT_FUNC          )) ?  3 : \
	((gpio == PB13) && (func == OCTOSPIM_P1_IO2_FUNC     )) ?  4 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == DFSDM1_CKIN1_FUNC        )) ?  6 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == USART3_NSS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == FDCAN2_TX_FUNC           )) ?  9 : \
	((gpio == PB13) && (func == USB_OTG_HS_ULPI_D6_FUNC  )) ? 10 : \
	((gpio == PB13) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PB13) && (func == SDMMC1_D0_FUNC           )) ? 12 : \
	((gpio == PB13) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PB13) && (func == PSSI_D2_FUNC             )) ? 13 : \
	((gpio == PB13) && (func == UART5_TX_FUNC            )) ? 14 : \
	((gpio == PB13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == TIM12_CH1_FUNC           )) ?  2 : \
	((gpio == PB14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB14) && (func == USART1_TX_FUNC           )) ?  4 : \
	((gpio == PB14) && (func == I2S2_SDI_FUNC            )) ?  5 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == DFSDM1_DATIN2_FUNC       )) ?  6 : \
	((gpio == PB14) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == UART4_DE_FUNC            )) ?  8 : \
	((gpio == PB14) && (func == UART4_RTS_FUNC           )) ?  8 : \
	((gpio == PB14) && (func == SDMMC2_D0_FUNC           )) ?  9 : \
	((gpio == PB14) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PB14) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PB14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PB14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM12_CH2_FUNC           )) ?  2 : \
	((gpio == PB15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == USART1_RX_FUNC           )) ?  4 : \
	((gpio == PB15) && (func == I2S2_SDO_FUNC            )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == DFSDM1_CKIN2_FUNC        )) ?  6 : \
	((gpio == PB15) && (func == UART4_CTS_FUNC           )) ?  8 : \
	((gpio == PB15) && (func == SDMMC2_D1_FUNC           )) ?  9 : \
	((gpio == PB15) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PB15) && (func == FMC_DA11_FUNC            )) ? 12 : \
