UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32h72_pinmux.h
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == PSSI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == PSSI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == PSSI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == PSSI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == PSSI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == PSSI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ08) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PJ08) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PJ08) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ09) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PJ09) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PJ09) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PJ10) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PJ10) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PJ11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PJ11) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PJ11) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK00) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PK00) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PK00) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK01) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PK01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PK01) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PK02) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PK02) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP1_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM8_BKIN_COMP2_FUNC     )) ? 10 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP1_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == TIM1_BKIN_COMP2_FUNC     )) ? 11 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA01) && (timer_nr == 15) && (channel_nr == -1)) ?  4 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr == 15) && (channel_nr ==  1)) ?  4 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr == 15) && (channel_nr ==  2)) ?  4 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA05) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA07) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB09) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB14) && (timer_nr == 12) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB15) && (timer_nr == 12) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PC12) && (timer_nr == 15) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE04) && (timer_nr == 15) && (channel_nr == -1)) ?  4 : \
	((gpio == PE05) && (timer_nr == 15) && (channel_nr ==  1)) ?  4 : \
	((gpio == PE06) && (timer_nr == 15) && (channel_nr ==  2)) ?  4 : \
	((gpio == PE08) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PE09) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PE13) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE14) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF00) && (timer_nr == 23) && (channel_nr ==  1)) ? 13 : \
	((gpio == PF01) && (timer_nr == 23) && (channel_nr ==  2)) ? 13 : \
	((gpio == PF02) && (timer_nr == 23) && (channel_nr ==  3)) ? 13 : \
	((gpio == PF03) && (timer_nr == 23) && (channel_nr ==  4)) ? 13 : \
	((gpio == PF06) && (timer_nr == 16) && (channel_nr ==  1)) ?  1 : \
	((gpio == PF06) && (timer_nr == 23) && (channel_nr ==  1)) ? 13 : \
	((gpio == PF07) && (timer_nr == 17) && (channel_nr ==  1)) ?  1 : \
	((gpio == PF07) && (timer_nr == 23) && (channel_nr ==  2)) ? 13 : \
	((gpio == PF08) && (timer_nr == 16) && (channel_nr == -1)) ?  1 : \
	((gpio == PF08) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PF08) && (timer_nr == 23) && (channel_nr ==  3)) ? 13 : \
	((gpio == PF09) && (timer_nr == 17) && (channel_nr == -1)) ?  1 : \
	((gpio == PF09) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PF09) && (timer_nr == 23) && (channel_nr ==  4)) ? 13 : \
	((gpio == PF11) && (timer_nr == 24) && (channel_nr ==  1)) ? 14 : \
	((gpio == PF12) && (timer_nr == 24) && (channel_nr ==  2)) ? 14 : \
	((gpio == PF13) && (timer_nr == 24) && (channel_nr ==  3)) ? 14 : \
	((gpio == PF14) && (timer_nr == 24) && (channel_nr ==  4)) ? 14 : \
	((gpio == PG12) && (timer_nr == 23) && (channel_nr ==  1)) ? 13 : \
	((gpio == PG13) && (timer_nr == 23) && (channel_nr ==  2)) ? 13 : \
	((gpio == PG14) && (timer_nr == 23) && (channel_nr ==  3)) ? 13 : \
	((gpio == PH06) && (timer_nr == 12) && (channel_nr ==  1)) ?  2 : \
	((gpio == PH09) && (timer_nr == 12) && (channel_nr ==  2)) ?  2 : \
	((gpio == PH10) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PH11) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PH12) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PH13) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PH14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PH15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PJ08) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PJ08) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PJ09) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PJ09) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PJ10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PJ10) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PJ11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PJ11) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PK00) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PK00) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PK01) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PK01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	AF_NO_SUCH_PINFUNC)
#endif
